{
    "cards": [
      {
        "header": "IBM Global Learning Consultant",
        "body": [
          {
            "paragraph": "Nick is a talented developer who manages his time and tasks very efficiently. He is communicative and raises issue and blockers in a timely fashion. I appreciate his willingness to 'go back to the drawing board' and seek creative solutions and innovative ways of achieving our business objectives."
          },
          {
            "paragraph": "Our most recent example of his growth mindset and genuine curiosity to explore creative solutions just arose as I was contemplating how to gather meaningful feedback from the pilot participants of this 15 week CS&P Strategy Academy pilot program that he is assisting in developing. Nick has been focused on iSPOs and knows the program well. I approached Nick about the feasibility of creating a 'feedback' iSPO that we could design to gather user feedback, design options, etc. at the end of the program, and which could be a component in the participants gaining program credit. It is ambitious and it hasn't yet been done. Once I had buy-in from our Learning Strategist, who loved the concept, he said, 'run it by Nick first' to understand the art of the possible. Nick said, 'hey let me look into it...' and started researching and reaching out to folks in key roles that touch learner surveys and tools, think40 credit, etc. and is helping me determine the viability of this concept. He just jumps right in and still balances innovative investigations with his development workload."
          }
        ],
        "footer": {
          "text": "-W.W., Apr 1, 2023 - Sep 14, 2023"
        }
      },
      {
        "header": "IBM Global Learning Consultant",
        "body": [
          {
            "paragraph": "Nick is really great to work with. He's flexible, willing to be a team player, and will contribute ideas to make the project better."
          },
          {
            "paragraph": "An 'even better if'...if I must say something here, I'd only suggest setting realistic turn-around times. Nick is a talented colleague, and a lot of people want to work with him, so the demands on his time are plenty. If something can be done by the end of the day, great. If though it may take two days, that's fine too (usually of course :) but just set that expectation."
          },
          {
            "paragraph": "I'd be happy to work with Nick again on future projects!"
          }
        ],
        "footer": {
          "text": "-K.M., Mar 31, 2023 - Sep 1, 2023"
        }
      },
      {
        "header": "IBM Consulting Global L&K, Senior Learning Strategist",
        "body": [
          {
            "paragraph": "I see Nick's key skills as a UI developer as technical proficiency, adaptability, creative thinking and problem solving. I feel that Nick should lean more into these as he seeks to grow his career and improve his project performance."
          },
          {
            "paragraph": "Nick often brings experiential perspective to his assigned work and is often able to solve problems in our education programs that block more junior UI programmers. He also is keen to share his knowledge with others in a coaching / mentoring capacity to help bring new UI programmers up to speed and value in the organization, often helping them complete their work."
          }
        ],
        "footer": {
          "text": "-K.S., Apr 1, 2023 - Sep 14, 2023"
        }
      },
      {
        "header": "IBM L&K Consultant",
        "body": [
          {
            "paragraph": "Nick was instrumental in helping to get this course completed and out the door in a timely manner. He is very accommodating to changes and requests based on the request from the LED (myself), SMEs, and other stakeholders."
          },
          {
            "paragraph": "His flexibility and being a team player were needed for this quick-moving project. In the future, I would love to see more of Nick's creative side, but I also understand that time is required for creativity to happen. One area of growth for Nick - and the entire development team- is to communicate realistic timelines based on competing projects. No matter our intent, there is only so much time in a day. We have to be BOLD and force our leaders to make tough decisions about delivery based on the resources available. I hope his team is able to benefit from and leverage the talent he possesses."
          }
        ],
        "footer": {
          "text": "-K.C., Apr 1, 2023 - Sep 14, 2023"
        }
      }
    ]
  }
  